Tekla Open API Reference for Tekla Structures 2025
PolycurveGeometryBuilder Constructor
Overload List
Name | Description
PolycurveGeometryBuilder()
 Creates an empty geometry builder. This builder contains no geometries
PolycurveGeometryBuilder(Polycurve)
 Constructs a geometry builder from an existing geometry list
Top
See Also
Reference
PolycurveGeometryBuilder Class
Tekla.Structures.Geometry3d Namespace